# DataFrame i Series

In [48]:
import pandas as pd

In [49]:
pd.read_excel("xl/course_participants.xlsx")

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    6.7   Ameryka
2   1002    Tim    41     USA    3.9   Ameryka
3   1003  Jenny    12  Niemcy    9.0    Europa

In [50]:
data=[["Mark", 55, "Włochy", 4.5, "Europa"],
      ["John", 33, "USA", 6.7, "Ameryka"],
      ["Tim", 41, "USA", 3.9, "Ameryka"],
      ["Jenny", 12, "Niemcy", 9.0, "Europa"]]

df = pd.DataFrame(data=data,
                  columns=["imię", "wiek", "kraj",
                           "ocena", "kontynent"],
                  index=[1001, 1000, 1002, 1003])
df

       imię  wiek    kraj  ocena kontynent
1001   Mark    55  Włochy    4.5    Europa
1000   John    33     USA    6.7   Ameryka
1002    Tim    41     USA    3.9   Ameryka
1003  Jenny    12  Niemcy    9.0    Europa

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   imię       4 non-null      object
 1   wiek       4 non-null      int64
 2   kraj       4 non-null      object
 3   ocena      4 non-null      float64
 4   kontynent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

In [52]:
df.dtypes

imię          object
wiek           int64
kraj          object
ocena        float64
kontynent     object
dtype: object

## Indeks

In [53]:
df.index

Int64Index([1001, 1000, 1002, 1003], dtype='int64')

In [54]:
df.index.name = "numer"
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [55]:
# Metoda "reset_index" przekształca indeks w kolumnę, zastępując
# indeks indeksem domyślnym. Odpowiada to pierwszemu DataFrame,
# który wczytaliśmy z Excela.
df.reset_index()

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    6.7   Ameryka
2   1002    Tim    41     USA    3.9   Ameryka
3   1003  Jenny    12  Niemcy    9.0    Europa

In [56]:
# Metoda "reset_index" zmienia "numer" w zwykłą kolumnę,
# a "set_index" zmienia kolumnę "imię" w indeks.
df.reset_index().set_index("imię")

       numer  wiek    kraj  ocena kontynent
imię
Mark    1001    55  Włochy    4.5    Europa
John    1000    33     USA    6.7   Ameryka
Tim     1002    41     USA    3.9   Ameryka
Jenny   1003    12  Niemcy    9.0    Europa

In [57]:
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [58]:
df.reindex([999, 1000, 1001, 1004])

       imię  wiek    kraj  ocena kontynent
numer
999     NaN   NaN     NaN    NaN       NaN
1000   John  33.0     USA    6.7   Ameryka
1001   Mark  55.0  Włochy    4.5    Europa
1004    NaN   NaN     NaN    NaN       NaN

In [59]:
df.sort_index()

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    6.7   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [60]:
df.sort_values(["kontynent", "wiek"])

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa
1001    Mark    55  Włochy    4.5    Europa

## Kolumny

In [61]:
df.columns

Index(['imię', 'wiek', 'kraj', 'ocena', 'kontynent'], dtype='object')

In [62]:
df.columns.name = "cechy"
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [63]:
df.rename(columns={"imię": "Imię", "wiek": "Wiek"})

cechy   Imię  Wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [64]:
df.drop(columns=["imię", "kraj"],
        index=[1000, 1003])
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [65]:
# create a sample dataframe
data = {"name": ["Alice", "Bob", "Charlie"],
        "age": [25, 30, 35],
        "gender": ["F", "M", "M"]}

df1 = pd.DataFrame(data)

print(df)

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [66]:
# drop the "gender" column
df1 = df1.drop("gender", axis=1)

print(df1)

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [28]:
# drop the "gender" column
df1 = df1.drop(columns="age",
             index=1)

print(df1)

      name
0    Alice
2  Charlie

In [67]:
df.T  # Skrót od df.transpose()

numer        1001     1000     1002    1003
cechy
imię         Mark     John      Tim   Jenny
wiek           55       33       41      12
kraj       Włochy      USA      USA  Niemcy
ocena         4.5      6.7      3.9       9
kontynent  Europa  Ameryka  Ameryka  Europa

In [ ]:
df.loc[:, ["kontynent", "kraj", "imię", "wiek", "ocena"]]

# Operowanie danymi
## Wybieranie danych

In [ ]:
# Użycie skalarów do wyboru zarówno wierszy, jak i kolumn, zwraca skalar
df.loc[1001, "imię"]

In [ ]:
# Użycie skalara do wyboru wiersza lub kolumny zwraca obiekt Series
df.loc[[1001, 1002], "wiek"]

In [ ]:
# Wybranie wielu wierszy i kolumn zwraca obiekt DataFrame
df.loc[:1002, ["imię", "kraj"]]

In [ ]:
df.iloc[0, 0]  # Zwraca skalar

In [ ]:
df.iloc[[0, 2], 1]  # Zwraca Series

In [ ]:
df.iloc[:3, [0, 2]]  # Zwraca DataFrame

In [ ]:
tf = (df["wiek"] > 40) & (df["kraj"] == "USA")
tf  # To jest obiekt Series zawierający wyłącznie wartości True lub False

In [ ]:
df.loc[tf, :]

In [ ]:
df.loc[df.index > 1001, :]

In [ ]:
df.loc[df["kraj"].isin(["Włochy", "Niemcy"]), :]

In [ ]:
# Może to być roczna suma opadów w milimetrach
rainfall = pd.DataFrame(data={"Miasto 1": [300.1, 100.2],
                              "Miasto 2": [400.3, 300.4],
                              "Miasto 3": [1000.5, 1100.6]})
rainfall

In [ ]:
rainfall < 400

In [ ]:
rainfall[rainfall < 400]

In [ ]:
# MultiIndex trzeba posortować
df_multi = df.reset_index().set_index(["kontynent", "kraj"])
df_multi = df_multi.sort_index()
df_multi

In [ ]:
df_multi.loc["Europa", :]

In [ ]:
df_multi.loc[("Europa", "Włochy"), :]

In [ ]:
df_multi.reset_index(level=0)

## Ustawianie danych

In [ ]:
# Najpierw skopiuj DataFrame, aby oryginał pozostał nietknięty
df2 = df.copy()

In [ ]:
df2.loc[1000, "imię"] = "JOHN"
df2

In [ ]:
df2.loc[[1000, 1001], "ocena"] = [3, 4]
df2

In [ ]:
tf = (df2["wiek"] < 20) | (df2["kraj"] == "USA")
df2.loc[tf, "imię"] = "xxx"
df2

In [ ]:
# Najpierw skopiuj DataFrame, aby oryginał pozostał nietknięty
rainfall2 = rainfall.copy()
rainfall2

In [ ]:
# Ustaw 0 wszędzie tam, gdzie wartości są poniżej 400
rainfall2[rainfall2 < 400] = 0
rainfall2

In [ ]:
df2.replace("USA", "Stany Zjednoczone")

In [ ]:
df2.loc[:, "rabat"] = 0
df2.loc[:, "cena"] = [49.9, 49.9, 99.9, 99.9]
df2

In [ ]:
df2 = df.copy()  # zacznijmy od nowej kopii
df2.loc[:, "rok urodzenia"] = 2021 - df2["wiek"]
df2

## Brakujące dane

In [ ]:
df2 = df.copy() # zacznijmy od nowej kopii
df2.loc[1000, "ocena"] = None
df2.loc[1003, :] = None
df2

In [ ]:
df2.dropna()

In [ ]:
df2.dropna(how="all")

In [ ]:
df2.isna()

In [ ]:
df2.fillna({"ocena": df2["ocena"].mean()})

## Zduplikowane dane

In [ ]:
df.drop_duplicates(["kraj", "kontynent"])

In [ ]:
df["kraj"].is_unique

In [ ]:
df["kraj"].unique()

In [ ]:
# Domyślnie jako True oznaczane są tylko duplikaty,
# (bez pierwszego wystąpienia)
df["kraj"].duplicated()

In [ ]:
# Aby uzyskać wszystkie wiersze, w których "kraj" jest zduplikowany,
# użyj keep=False
df.loc[df["kraj"].duplicated(keep=False), :]

## Operacje arytmetyczne

In [ ]:
rainfall

In [ ]:
rainfall + 100

In [ ]:
more_rainfall = pd.DataFrame(data=[[100, 200], [300, 400]],
                             index=[1, 2],
                             columns=["Miasto 1", "Miasto 4"])
more_rainfall

In [ ]:
rainfall + more_rainfall

In [ ]:
rainfall.add(more_rainfall, fill_value=0)

In [ ]:
# Obiekt Series pobrany z wiersza
rainfall.loc[1, :]

In [ ]:
rainfall + rainfall.loc[1, :]

In [ ]:
# Obiekt Series pobrany z kolumny
rainfall.loc[:, "Miasto 2"]

In [ ]:
rainfall.add(rainfall.loc[:, "Miasto 2"], axis=0)

In [ ]:
# Utwórzmy nowy obiekt DataFrame
users = pd.DataFrame(data=[" mArk ", "JOHN  ", "Tim", " jenny"],
                     columns=["imię"])
users

In [ ]:
users_cleaned = users.loc[:, "imię"].str.strip().str.capitalize()
users_cleaned

In [ ]:
users_cleaned.str.startswith("J")

## Stosowanie funkcji

In [ ]:
rainfall

In [ ]:
def format_string(x):
    return f"{x:,.2f}"

In [ ]:
# Zauważ, że przekazujemy funkcję bez jej wywołania,
# czyli format_string, a nie format_string()!
rainfall.applymap(format_string)

In [ ]:
rainfall.applymap(lambda x: f"{x:,.2f}")

# Łączenie obiektów DataFrame
## Konkatenacja

In [ ]:
data=[[15, "Francja", 4.1, "Becky"],
      [44, "Kanada", 6.1, "Leanne"]]
more_users = pd.DataFrame(data=data,
                          columns=["wiek", "kraj", "ocena", "imię"],
                          index=[1000, 1011])
more_users

In [ ]:
pd.concat([df, more_users], axis=0)

In [ ]:
data=[[3, 4],
      [5, 6]]
more_categories = pd.DataFrame(data=data,
                               columns=["testy", "logowania"],
                               index=[1000, 2000])
more_categories

In [ ]:
pd.concat([df, more_categories], axis=1)

## Operacje join i merge

In [ ]:
df1 = pd.DataFrame(data=[[1, 2], [3, 4], [5, 6]],
                   columns=["A", "B"])
df1

In [ ]:
df2 = pd.DataFrame(data=[[10, 20], [30, 40]],
                   columns=["C", "D"], index=[1, 3])
df2

In [ ]:
df1.join(df2, how="inner")

In [ ]:
df1.join(df2, how="left")

In [ ]:
df1.join(df2, how="right")

In [ ]:
df1.join(df2, how="outer")

In [ ]:
# Dodaj kolumnę o nazwie "kategoria" do obu obiektów DataFrame
df1["kategoria"] = ["a", "b", "c"]
df2["kategoria"] = ["c", "b"]

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.merge(df2, how="inner", on=["kategoria"])

In [ ]:
df1.merge(df2, how="left", on=["kategoria"])

# Statystyka opisowa i agregacja danych
## Statystyka opisowa

In [ ]:
rainfall

In [ ]:
rainfall.mean()

In [ ]:
rainfall.mean(axis=1)

## Grupowanie

In [ ]:
df.groupby(["kontynent"]).mean()

In [ ]:
df.groupby(["kontynent", "kraj"]).mean()

In [ ]:
df.groupby(["kontynent"]).agg(lambda x: x.max() - x.min())

## Funkcje pivot_table i melt

In [ ]:
data = [["Pomarańcze", "Północ", 12.30],
        ["Jabłka", "Południe", 10.55],
        ["Pomarańcze", "Południe", 22.00],
        ["Banany", "Południe", 5.90],
        ["Banany", "Północ", 31.30],
        ["Pomarańcze", "Północ", 13.10]]

sales = pd.DataFrame(data=data,
                     columns=["Owoce", "Region", "Przychód"])
sales

In [ ]:
pivot = pd.pivot_table(sales,
                       index="Owoce", columns="Region",
                       values="Przychód", aggfunc="sum",
                       margins=True, margins_name="Ogółem")
pivot

In [ ]:
pd.melt(pivot.iloc[:-1,:-1].reset_index(),
        id_vars="Owoce",
        value_vars=["Północ", "Południe"], value_name="Przychód")

# Tworzenie wykresów
## Matplotlib

In [ ]:
import numpy as np
%matplotlib inline
# lub %matplotlib notebook

In [ ]:
data = pd.DataFrame(data=np.random.rand(4, 4) * 100000,
                    index=["I kw.", "II kw.", "III kw.", "IV kw."],
                    columns=["Wschód", "Zachód", "Północ", "Południe"])
data.index.name = "Kwartały"
data.columns.name = "Region"
data

In [ ]:
data.plot()  # Skrót od data.plot.line()

## Plotly

In [ ]:
# Ustaw silnik tworzenia wykresów na Plotly
pd.options.plotting.backend = "plotly"

In [ ]:
data.plot()

In [ ]:
# Wyświetl te same dane jako wykres słupkowy
data.plot.bar(barmode="group")

# Import i eksport danych
## Eksport pliku CSV

In [ ]:
df.to_csv("course_participants.csv")

## Import pliku CSV

In [ ]:
msft = pd.read_csv("csv/MSFT.csv")

In [ ]:
msft.info()

In [ ]:
# Z powodu braku miejsca wybieram tylko kilka kolumn
# Możesz też po prostu uruchomić: msft.head()
msft.loc[:, ["Date", "Adj Close", "Volume"]].head()

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].tail(2)

In [ ]:
msft.loc[:, ["Adj Close", "Volume"]].describe()

In [ ]:
# Adres URL został podzielony na wiersze, aby zmieścił się na stronie.
url = ("https://raw.githubusercontent.com/fzumstein/"
       "python-for-excel/1st-edition/csv/MSFT.csv")
msft = pd.read_csv(url)

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].head(2)